Revit 2027 API
HemisphericalLightDistribution(HemisphericalLightDistribution) Constructor
 Creates a copy of the given hemispherical light distribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HemisphericalLightDistribution(
	HemisphericalLightDistribution other
)
Public Sub New (
	other As HemisphericalLightDistribution
)
public:
HemisphericalLightDistribution(
	HemisphericalLightDistribution^ other
)
new :
        other : HemisphericalLightDistribution -> HemisphericalLightDistribution
Parameters
other HemisphericalLightDistribution
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
HemisphericalLightDistribution Class
HemisphericalLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace